# 数据处理
### 1. 读写数据
1. 读取文本文件和其他更高效的磁盘存储格式
pd.read_csv()
pd.read_excel()
pd.read_table()
2. 加载数据库中的数据
3. 利用Web API操作网络资源
### 2. 数据清洗
1. 缺失值处理：
 - 检测缺失值np.isnull(),pd.isna(),pd.notnull(), pd.notna()
 - 填充缺失值np.filna()
 - 过滤缺失值pd.dropna()
2. 数据转换：
 - 移除重复数据,df.duplicated(), df.drop_duplicates()
 - 替换值df.replace()
 - 重命名索引轴 df.index.map(), df.rename()
 _ 离散化和面元划分,pd.cut(series, 区间)
 - 检测与过滤异常值
 - 随机重排列
3. 字符串操作

### 3. 数据转换
### 4. 数据重塑
###

In [1]:
import pandas as pd
import numpy as np

In [14]:
data = pd.Series([1, np.nan, 4, np.nan, None])

In [15]:
data

0    1.0
1    NaN
2    4.0
3    NaN
4    NaN
dtype: float64

In [16]:
data.isnull()
pd.isnull(data)
data.isna()
data.notna()

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [13]:
data.dropna()
data[data.notna()]

0    1.0
2    4.0
dtype: float64

In [17]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
   ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [18]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [20]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [21]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])

In [22]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [23]:
transform = lambda x: x[:4].upper()

In [31]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [32]:
data.rename(columns=str.upper)

      ONE  TWO  THREE  FOUR
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [33]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [34]:
bins = [18, 25, 35, 60, 100]

In [35]:
cats = pd.cut(ages, bins)

In [36]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [37]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [38]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010089    -0.011016    -0.008077     0.029840
std       0.998753     0.965725     1.016504     1.000078
min      -3.962981    -3.078888    -3.138863    -3.348917
25%      -0.700052    -0.653616    -0.672067    -0.661033
50%       0.026652     0.006765    -0.009874     0.025489
75%       0.709376     0.635992     0.742069     0.678417
max       2.839783     2.930057     3.617286     3.169267

In [39]:
col = data[2]

In [41]:
col[np.abs(col) > 3]

341    3.617286
582   -3.138863
583    3.037329
Name: 2, dtype: float64

In [49]:
#np.sign(data)

In [43]:
import numpy as np
import pandas as pd

In [44]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [45]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [46]:
sampler = np.random.permutation(5)

In [47]:
sampler

array([1, 3, 0, 2, 4])

In [48]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [50]:
from dateutil.parser import parse

In [51]:
parse('2011-2-5')

datetime.datetime(2011, 2, 5, 0, 0)

In [52]:
parse('Jan 31, 1995 10 PM')

datetime.datetime(1995, 1, 31, 22, 0)

In [53]:
parse('6/12/2011', dayfirst=True)

datetime.datetime(2011, 12, 6, 0, 0)